src/cf/Catalogs/ШаблоныИменФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныИменФайлов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиШаблоновИмени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиШаблоновИмени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонИмени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИменФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовШаблоновИмениФайла</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ШаблоныИменФайлов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Если ПометкаУдаления Тогда 
			
			// сотрем запись РС
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	НастройкиШаблоновИмени.ТипОбъекта КАК ТипОбъекта,
				|	НастройкиШаблоновИмени.Вид КАК Вид,
				|	НастройкиШаблоновИмени.РольФайла КАК РольФайла
				|ИЗ
				|	РегистрСведений.НастройкиШаблоновИмени КАК НастройкиШаблоновИмени
				|ГДЕ
				|	НастройкиШаблоновИмени.ШаблонИмени = &ШаблонИмени";
			
			Запрос.УстановитьПараметр("ШаблонИмени", Ссылка);
			Результат = Запрос.Выполнить();
			
			// все сотрем
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.НастройкиШаблоновИмени.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ТипОбъекта.Установить(Выборка.ТипОбъекта);
				НаборЗаписей.Отбор.Вид.Установить(Выборка.Вид);
				НаборЗаписей.Отбор.РольФайла.Установить(Выборка.РольФайла);
				НаборЗаписей.Записать();
				
			КонецЦикла;	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
